Revit 2018 API
Duct.Create Method (Document, ElementId, ElementId, Connector, XYZ)
 Creates a new duct that connects to the connector.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public static Duct Create(
	Document document,
	ElementId ductTypeId,
	ElementId levelId,
	Connector startConnector,
	XYZ endPoint
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	ductTypeId As ElementId, _
	levelId As ElementId, _
	startConnector As Connector, _
	endPoint As XYZ _
) As Duct
Visual C++
public:
static Duct^ Create(
	Document^ document,
	ElementId^ ductTypeId,
	ElementId^ levelId,
	Connector^ startConnector,
	XYZ^ endPoint
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
ductTypeId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of the new duct type.
levelId
Type: Autodesk.Revit.DB.ElementId
 The level id for the new duct.
startConnector
Type: Autodesk.Revit.DB.Connector
 The first connector where the new duct starts.
endPoint
Type: Autodesk.Revit.DB.XYZ
 The second point of the new duct.
Return Value
 The created duct.
Remarks
 The new duct will have the same diameter and system type as the specified connector. The creation will also connect the new duct to the component who owns the specified connector. If necessary, additional fitting(s) are included to make a valid connection. If the new duct can not be connected to the next component (e.g., mismatched direction, no valid fitting, and etc), the new duct will still be created at the specified connector position, and an InvalidOperationException is thrown.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The duct type ductTypeId is not valid duct type. -or- The level id levelId is not valid. -or- The connector's domain is not Domain.​DomainHvac. -or- The points of startConnector and endPoint are equal.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the new duct fails to connect with the connector.
See Also
Duct Class
Create Overload
Autodesk.Revit.DB.Mechanical Namespace